Assert-Promotion-service/getRegions.yml
config:
  target: "https://staging-dashboard.cliquidator.info"
  tls: 
    rejectUnauthorized: false
  processor: '../login_processor.js'
  phases:
    - name: "load testing"
      duration: 2
      arrivalRate: 1

scenarios:
  - name: "Get Assets"
    flow:
      - function: "getToken"
      - get:
          url: "/v1/regions"
          headers:
            Authorization: "Bearer {{ token }}"
            Content-Type: "application/json"
          capture:
            - json: "$.sucess"
              as: "status"
      - log: "status: {{ status }}"